<template>
  <div>
    <swiper class="swiper" :options="swiperOption">
      <swiper-slide class="text">
        <div>
          “中朝传统友谊是两党两国老一辈领导人亲自缔造和精心培育的，是双方共同的宝贵财富。”“中朝几代领导人一直保持着密切交往，像走亲戚一样常来常往。”3月底，在同金正恩举行首次会晤时，习近平就用“国际关系史上的一段佳话”高度评价中朝传统友谊，亲切表示“我和委员长同志都是中朝关系发展的亲历者和见证者”。习近平强调传承发展好中朝关系是“双方基于历史和现实，立足于国际地区格局和中朝关系大局，作出的战略选择，也是唯一正确选择，不应也不会因一时一事而变化”。春暖花开时节的会晤，达成的“四方面原则共识”犹如东风拂面暖人心扉：——中朝传统友谊是双方共同的宝贵财富，发展好中朝友好合作关系是双方坚定不移的方针，也是唯一正确选择。——中朝同为社会主义国家，双边关系具有重大战略意义，要加强团结合作、交流互鉴。——两党高层交往对于引领双边关系具有不可替代的重大作用，双方应保持经常往来，加强战略沟通，增加理解互信，维护共同利益。
——夯实民间友好基础是推进中朝关系发展的重要途径，应通过多种形式，加强两国人民交流往来，为中朝关系发展营造良好民意基础。
5月初的会晤，在“在双方共同努力下，各项共识正在得到良好的贯彻落实”的背景下举行。“我同委员长同志首次会晤以来，中朝关系和朝鲜半岛形势均取得积极进展，我对此感到高兴”，习近平表示“愿同委员长同志再次举行会晤，共同为推动中朝关系健康稳定发展、实现朝鲜半岛长治久安、促进地区和平稳定繁荣作出努力”。
“朝中两党两国老一辈领导人同志式的相互信任和情义，是朝中传统友谊的亲密纽带和坚实根基。”金正恩积极作出回应表示，“相信时隔一个多月的再次会晤将加深彼此互信，推动朝中友好合作关系顺应新时代的要求，取得更为密切的全面发展”。
话题二：半岛局势
当下，朝鲜半岛局势正处在深刻复杂演变的关键时刻，半岛问题是国际范围受到广泛关注的焦点之一。
在首次会晤时，习近平同金正恩就此问题深入交换了意见，呼吁各方支持半岛北南双方改善关系，共同为劝和促谈作出切实努力，并且表示“中方愿在半岛问题上继续发挥建设性作用，同包括朝方在内的各方一道努力，共同推动半岛形势走向缓和”。
3月29日，韩国和朝鲜代表在板门店朝方一侧的统一阁举行高级别会谈。
4月20日，朝鲜劳动党七届三中全会提出了全党全国集中一切力量进行社会主义经济建设的战略路线，宣布停止核试验和洲际弹道导弹试射、废弃北部核试验场。
4月27日，韩国总统文在寅和朝鲜国务委员会委员长金正恩在板门店举行会晤并签署《板门店宣言》，宣布双方将为实现朝鲜半岛无核化和停和机制转换而努力。
“在有关各方共同努力下，半岛对话缓和势头正不断巩固，朝着有利于推动政治解决的方向发展。”本次会晤时，习近平表示，中方支持朝方坚持半岛无核化，支持朝美对话协商解决半岛问题，愿继续同有关各方一道，为全面推进半岛问题和平对话解决进程、实现地区长治久安发挥积极作用。金正恩则高度评价了习近平总书记的远见卓识，感谢中方长期以来为实现半岛无核化、维护地区和平稳定作出的重要贡献。
话题三：发展道路
珍视和平，尊重各国自主选择的发展道路，这是习近平在国际场合反复提及的重要理念，也是国际关系基本准则和时代潮流的必然要求。
“中国特色社会主义已经进入新时代，朝鲜社会主义建设也进入了新的历史时期。”首次会晤时，习近平指出，我们希望朝鲜政治稳定、经济发展、人民幸福，支持以委员长同志为首的朝鲜劳动党带领朝鲜人民沿着社会主义道路不断前进，支持朝鲜同志为发展经济、改善民生所作积极努力。
本次会晤时，习近平对朝鲜近期作出的系列决策表示赞赏，并且表示“支持朝方战略重心转向经济建设，支持朝鲜同志走符合本国国情的发展道路”。
“我愿同委员长同志一道，继续指导双方有关部门落实好我们达成的共识，推动中朝关系不断向前发展，造福两国和两国人民，为本地区和平稳定作出积极贡献。”习近平的话语情真意切。
        </div>
      </swiper-slide>
    </swiper>
  </div>
</template>

<script>
import 'swiper/dist/css/swiper.css'
import {swiper, swiperSlide} from 'vue-awesome-swiper'
export default {
  data () {
    return {
      swiperOption: {
        direction: 'vertical',
        slidesPerView: 'auto',
        freeMode: true,
        mousweheel: true
      }
    }
  },
  components: { swiper, swiperSlide }
}
</script>

<style scoped>
  .swiper {
    height: 300px;
    overflow: hidden;
  }
  .text {
    font-size: 18px;
    text-align: left;
    padding: 30px;
    height: auto;
    -webkit-box-sizing: border-box;
    box-sizing: border-box;
  }
</style>
